# StructuralConnectionEditRangesOfApplicability Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralConnectionEditRangesOfApplicability Property
ParameterTypeId Class See Also
---
"Modify Ranges of applicability"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralConnectionEditRangesOfApplicability { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionEditRangesOfApplicability As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralConnectionEditRangesOfApplicability {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace